Revit 2026 API

# FluidTypeCreate(Document, String, FluidType) Method

---

Creates a new fluid type and adds it to the document.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FluidType Create(
	Document document,
	string fluidTypeName,
	FluidType basedOnFluidType
)
```
```vb
Public Shared Function Create (
	document As Document,
	fluidTypeName As String,
	basedOnFluidType As FluidType
) As FluidType
```
```cpp
public:
static FluidType^ Create(
	Document^ document,
	String^ fluidTypeName,
	FluidType^ basedOnFluidType
)
```
```fsharp
static member Create :
        document : Document *
        fluidTypeName : string *
        basedOnFluidType : FluidType -> FluidType
```

#### Parameters

document Document
     The document.
fluidTypeName String
     The name of new created fluid type.
basedOnFluidType FluidType
     The existing fluid type which is based on.

#### Return Value

FluidType The newly created fluid type.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The new fluid type will be a duplicate of the input type.

#### Reference

FluidType Class

Create Overload

Autodesk.Revit.DB.Plumbing Namespace